Locked-Inc/STAR/star-rx72n-firmware/libs/rx_bus/src/rx_bus_onewire.c
/**
 * @file rx_bus_onewire.c
 * @brief OneWire (1-Wire) Bus Implementation Using GPIO Bit-Banging
 *
 * @details
 * Implements the Dallas/Maxim 1-Wire protocol using software bit-banging on
 * GPIO pins. Provides all standard 1-Wire operations: reset/presence detect,
 * bit/byte read/write, and ROM commands (Skip, Match, Read, Search).
 *
 * @par Implementation Architecture:
 * @msc
 * App, Bus_Manager, OneWire, GPIO, Timer;
 * --- [label="Reset Pulse"];
 * App => Bus_Manager [label="reset()"];
 * Bus_Manager => OneWire [label="callback"];
 * OneWire => GPIO [label="drive_low()"];
 * OneWire => Timer [label="delay_us(480)"];
 * OneWire => GPIO [label="release()"];
 * OneWire => Timer [label="delay_us(70)"];
 * OneWire => GPIO [label="read()"];
 * OneWire => Bus_Manager [label="presence"];
 * @endmsc
 *
 * @par 1-Wire Timing (Standard Speed):
 * | Operation        | Parameter          | Value    |
 * |------------------|--------------------|----------|
 * | Reset pulse      | T_RSTL             | 480 us   |
 * | Presence wait    | T_PDH              | 70 us    |
 * | Presence tail    | T_RSTH             | 410 us   |
 * | Write-1 low      | T_LOW1             | 6 us     |
 * | Write-1 high     | T_SLOT - T_LOW1    | 64 us    |
 * | Write-0 low      | T_LOW0             | 60 us    |
 * | Write-0 high     | T_SLOT - T_LOW0    | 10 us    |
 * | Read init        | T_LOWR             | 6 us     |
 * | Read sample      | T_RDV              | 9 us     |
 * | Read recovery    | T_REC              | 55 us    |
 *
 * @par Open-Drain Emulation:
 * GPIO is configured as:
 * - Output LOW to drive line low
 * - Input (high-Z) to release line (external 4.7kOhm pullup drives high)
 *
 * @par Hardware Requirements:
 * - 4.7kOhm external pullup resistor on 1-Wire data line
 * - CMT3 timer for microsecond delays (PCLKB/8 = 7.5 MHz)
 * - GPIO pin with configurable direction
 *
 * @par Supported Devices:
 * | Device   | Family Code | Description              |
 * |----------|-------------|--------------------------|
 * | DS18B20  | 0x28        | Temperature sensor       |
 * | DS18S20  | 0x10        | Temperature sensor       |
 * | DS2431   | 0x2D        | 1Kb EEPROM               |
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 1: [OK] No goto, setjmp, recursion
 * - Rule 2: [OK] Loops bounded (k_bits_per_byte, k_onewire_rom_bytes)
 * - Rule 3: [OK] No dynamic allocation (static state pool)
 * - Rule 5: [OK] Pre/post conditions on all functions
 * - Rule 7: [OK] All return values checked
 * - Rule 8: [OK] Typed enums for all constants
 *
 * @par SOLID Principles:
 * - SRP: Handles 1-Wire protocol only, delegates GPIO to HAL
 * - OCP: Extensible via callback pattern (bus_manager)
 * - DIP: Depends on GPIO abstraction, not direct register access
 *
 * @see rx_bus_onewire.h Public API header
 * @see rx_bus_manager.h Bus manager integration
 * @see gpio.c GPIO driver used for bit-banging
 *
 * @author Locked, Inc.
 * @date 2026-01-03
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 */

#include "rx_bus_onewire.h"

#include <string.h>

#include "hardware.h"
#include "rx72n_clock.h"
#ifdef UNIT_TEST
#include "mock_rx72n_cmt_regs.h"
#include "mock_rx72n_regs.h"
#include "mock_rx72n_system_regs.h"
#else
#include "rx72n_cmt_regs.h"
#include "rx72n_regs.h"
#include "rx72n_system_regs.h"
#endif
#include "rx_bus_types.h"
#include "rx_check.h"
#include "rx_crc.h"
#include "rx_log.h"
#include "rx_register_protection.h"

static const char*    s_tag                        = "BUS_ONEWIRE";
static const uint32_t s_onewire_max_search_devices = 64U;

/* =============================================================================
 * Internal State Tracking
 * =============================================================================
 */

/** @brief OneWire driver constants. */
typedef enum : uint8_t {
  k_onewire_max_instances         = k_max_buses,
  k_onewire_single_bit_mask       = 0x01U,
  k_onewire_search_last_zero_init = 0U,
  k_onewire_first_bit_number      = 1U,
  k_onewire_rom_bit_mask_reset    = 1U,
  k_onewire_no_discrepancy        = 0U,
  k_onewire_max_buf_bytes         = 255U,
  k_onewire_bit_mask_lsb          = 1U,
  k_onewire_crc_offset            = 1U,
  k_onewire_rom_family_code_idx   = 0U,
  k_onewire_invalid_family_code   = 0x00U,
  k_onewire_instance_idx_start    = 0U, /**< Starting index for instance pool iteration */
  k_onewire_rom_crc_idx           = 7U, /**< CRC byte index in ROM (k_onewire_rom_crc_idx) */
} onewire_driver_constants_t;

/**
 * @brief Runtime state per OneWire bus.
 *
 * Tracks ROM search progress plus cached drive mode to avoid redundant GPIO
 * reconfiguration.
 */
#ifndef UNIT_TEST
typedef struct {
  uint8_t last_rom[k_onewire_rom_bytes]; /**< Last ROM discovered */
  uint8_t last_discrepancy;              /**< Search tree discrepancy bit */
  bool    last_device_flag;              /**< True when last device enumerated */
  bool    line_is_output;                /**< Current GPIO drive mode */
} onewire_runtime_state_t;
#endif /* UNIT_TEST */

/** @brief Static pool for OneWire runtime state (zero-allocation pattern). */
typedef struct {
  bool                    in_use;
  onewire_runtime_state_t state;
} onewire_state_entry_t;

static onewire_state_entry_t s_state_pool[k_onewire_max_instances];

/* =============================================================================
 * Timer-Based Delay Helpers
 * =============================================================================
 */

/**
 * @brief Hardware timer configuration for microsecond delays.
 *
 * Uses CMT channel 3 in free-run mode (no interrupts) as a 16-bit counter
 * clocked from PCLKB/8 (7.5 MHz). Delays are implemented by measuring elapsed
 * ticks to ensure consistent timing independent of compiler optimizations.
 */
typedef enum : uint32_t {
  k_onewire_mstpb_cmt_bit       = 15, /**< CMT module stop bit in MSTPCRB */
  k_onewire_cmt3_start_bit      = 1,  /**< CMSTR1 bit controlling CMT3 */
  k_onewire_cmt_divider_setting = 0,  /**< CKS = 0 -> PCLKB/8 */
  k_onewire_cmt_divider_value   = 8,  /**< Actual divider value */
  k_onewire_cmt_clk_shift       = 0,  /**< CMCR clock select shift */
  k_onewire_timer_counter_max   = 0xFFFF,
  k_onewire_us_per_second       = 1000000UL,
  k_onewire_timer_rounding      = k_onewire_us_per_second - 1UL,
  k_onewire_bit_set             = 1U,
  k_onewire_counter_reset       = 0U,
  k_onewire_zero_microseconds   = 0U,
} onewire_delay_hw_constants_t;

typedef enum : uint64_t {
  k_onewire_ticks_zero = 0ULL,
} onewire_delay_tick_constants_t;

