Locked-Inc/STAR/star-rx72n-firmware/libs/rx_bus/src/rx_bus_onewire.c
static bool s_delay_timer_initialized = false;

/**
 * @brief Initialize CMT3 timer for microsecond-precision delays
 *
 * @details
 * Configures CMT channel 3 as a free-running 16-bit counter for timing delays.
 * Uses PCLKB/8 clock source (7.5 MHz at 60 MHz PCLKB) for ~133ns resolution.
 * Timer runs continuously without interrupts.
 *
 * @par Algorithm:
 * 1. Check if already initialized (early return)
 * 2. Assert register pointers are valid
 * 3. Unlock MSTPCRB via PRCR
 * 4. Enable CMT module clock (clear MSTPB15)
 * 5. Lock PRCR
 * 6. Stop CMT3 (clear CMSTR1 bit 1)
 * 7. Configure CMCR for PCLKB/8, no interrupts
 * 8. Set CMCOR to 0xFFFF (full 16-bit range)
 * 9. Reset counter to 0
 * 10. Start timer (set CMSTR1 bit 1)
 *
 * @pre System clocks initialized (PCLKB running)
 * @post CMT3 running as free-running counter
 * @post s_delay_timer_initialized == true
 *
 * @note Called automatically by internal_delay_us() on first use
 * @note Timer resolution: 1 / (PCLKB/8) = 133ns @ 60MHz PCLKB
 *
 * @see internal_delay_us() Uses this timer for delays
 */
RX_STATIC_TESTABLE void internal_delay_timer_init(void)
{
  if (s_delay_timer_initialized) {
    return;
  }

  /* Enable CMT module clock */
  *prcr_reg() = k_rx_prcr_unlock_prc1_prc3;
  system_regs()->mstpcrb &= ~((uint32_t)k_onewire_bit_set << k_onewire_mstpb_cmt_bit);
  *prcr_reg() = k_rx_prcr_lock;

  /* Stop CMT3 before reconfiguration */
  cmt_ctrl()->cmstr1 &= (uint16_t) ~((uint16_t)k_onewire_bit_set << k_onewire_cmt3_start_bit);

  /* Configure free-running counter (no interrupts) */
  cmt3()->cmcr  = (uint16_t)(k_onewire_cmt_divider_setting << k_onewire_cmt_clk_shift);
  cmt3()->cmcor = k_onewire_timer_counter_max;
  cmt3()->cmcnt = k_onewire_counter_reset;

  /* Start timer */
  cmt_ctrl()->cmstr1 |= ((uint16_t)k_onewire_bit_set << k_onewire_cmt3_start_bit);

  s_delay_timer_initialized = true;
}

/**
 * @brief Delay for specified microseconds using CMT3 timer
 *
 * @details
 * Implements busy-wait delay using CMT3 counter. Handles delays longer than
 * the 16-bit counter maximum by looping. Automatically initializes timer on
 * first call.
 *
 * @par Algorithm:
 * 1. Return immediately if microseconds == 0
 * 2. Initialize timer if not already done
 * 3. Calculate required ticks: (us * timer_hz + round) / 1000000
 * 4. Ensure minimum 1 tick for very short delays
 * 5. Loop while ticks > 0:
 *    a. Calculate wait_ticks (capped at 0xFFFF)
 *    b. Read start counter value
 *    c. Busy-wait until (current - start) >= wait_ticks
 *    d. Subtract wait_ticks from remaining
 *
 * @param[in] microseconds Delay duration in microseconds (0 = no delay)
 *
 * @pre System clocks initialized
 * @post Delay of approximately `microseconds` us elapsed
 *
 * @note Busy-wait implementation, blocks CPU
 * @note Accuracy: +/-1 timer tick (~133ns @ 7.5MHz)
 * @note Maximum single delay: limited by uint32_t microseconds
 *
 * @par Performance:
 * - Overhead: ~10 cycles for function call
 * - Resolution: 133ns (1 tick @ 7.5MHz)
 * - Accuracy: +/-0.5% typical
 *
 * @warning Disables preemption during delay (busy-wait)
 *
 * @see internal_delay_timer_init() Timer initialization
 */
RX_STATIC_TESTABLE void internal_delay_us(uint32_t microseconds)
{
  if (microseconds == k_onewire_zero_microseconds) {
    return;
  }

  internal_delay_timer_init();

  const uint32_t timer_hz = k_pclkb_hz / k_onewire_cmt_divider_value;
  uint64_t       ticks = ((uint64_t)microseconds * (uint64_t)timer_hz + k_onewire_timer_rounding) /
                   k_onewire_us_per_second;

  while (ticks > k_onewire_ticks_zero) {
    uint32_t wait_ticks =
      (ticks > k_onewire_timer_counter_max) ? k_onewire_timer_counter_max : (uint32_t)ticks;
    uint16_t start = cmt3()->cmcnt;
    while ((uint16_t)(cmt3()->cmcnt - start) < wait_ticks) {
      __asm__ volatile("nop");
    }
    ticks -= wait_ticks;
  }
}

/* =============================================================================
 * Internal Helpers (State / GPIO Control)
 * =============================================================================
 */

/**
 * @brief Acquire or allocate runtime state for a 1-Wire bus
 *
 * @details
 * Ensures a runtime state structure exists for the bus. If the bus already
 * has state (handle != nullptr), returns existing state. Otherwise allocates
 * from static pool. Uses zero-allocation pattern for NASA Rule 3 compliance.
 *
 * @par Algorithm:
 * 1. If bus_config->handle != nullptr, return existing state
 * 2. Search static pool for unused entry
 * 3. Mark entry as in_use, zero-initialize state
 * 4. Store pointer in bus_config->handle
 * 5. Return state pointer via output parameter
 *
 * @param[in,out] bus_config Bus configuration node (handle field updated)
 * @param[out] state Pointer to receive runtime state
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success, state available
 * @retval k_rx_err_no_mem Static pool exhausted (k_onewire_max_instances)
 *
 * @pre bus_config != nullptr
 * @pre state != nullptr
 * @post *state points to valid runtime state
 * @post bus_config->handle points to same state
 *
 * @note Uses static pool, no dynamic allocation
 * @note Pool size: k_onewire_max_instances (= k_max_buses)
 *
 * @see internal_get_state() Retrieve existing state
 */
static rx_err_t internal_acquire_state(rx_bus_config_t* bus_config, onewire_runtime_state_t** state)
{
  if (bus_config->handle != nullptr) {
    *state = (onewire_runtime_state_t*)bus_config->handle;
    return k_rx_ok;
  }
  for (uint32_t i = k_onewire_instance_idx_start; i < k_onewire_max_instances; ++i) {
    if (!s_state_pool[i].in_use) {
      s_state_pool[i].in_use = true;
      s_state_pool[i].state  = (onewire_runtime_state_t){0};
      bus_config->handle     = &s_state_pool[i].state;
      *state                 = &s_state_pool[i].state;
      return k_rx_ok;
    }
  }

  return k_rx_err_no_mem;
}

/**
 * @brief Retrieve runtime state for already-initialized bus.
 *
 * @param[in] bus_config Bus configuration node
 *
 * @return Pointer to state or nullptr if missing
 */
static inline onewire_runtime_state_t* internal_get_state(const rx_bus_config_t* bus_config)
{
  return (onewire_runtime_state_t*)bus_config->handle;
}

/**
 * @brief Configure GPIO drive mode (output low vs input/high-Z).
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] state Runtime state tracking current mode
 * @param[in] output True to drive (output), false to release (input)
 *
 * @return k_rx_ok on success
 */
RX_STATIC_TESTABLE rx_err_t internal_set_drive_mode(const rx_bus_config_t*   bus_config,
                                                    onewire_runtime_state_t* state,
                                                    const bool               output)
{
  rx_err_t err = k_rx_ok;
  if (output && !state->line_is_output) {
    err = gpio_set_output(bus_config->proto.onewire.pin);
    if (err != k_rx_ok) {
      return err;
    }
    state->line_is_output = true;
  } else if (!output && state->line_is_output) {
    err = gpio_set_input(bus_config->proto.onewire.pin);
    if (err != k_rx_ok) {
      return err;
    }
    state->line_is_output = false;
  }
  return k_rx_ok;
}

/**
 * @brief Drive the OneWire line low (open-drain style).
 */
RX_STATIC_TESTABLE rx_err_t internal_drive_low(rx_bus_config_t*         bus_config,
                                               onewire_runtime_state_t* state)
{
  const rx_err_t err = internal_set_drive_mode(bus_config, state, true);
  if (err != k_rx_ok) {
    return err;
  }
  return gpio_write_low(bus_config->proto.onewire.pin);
}

/**
 * @brief Release the OneWire line (input/high-Z, external pull-up drives high).
 */
RX_STATIC_TESTABLE rx_err_t internal_release_line(rx_bus_config_t*         bus_config,
                                                  onewire_runtime_state_t* state)
{
  return internal_set_drive_mode(bus_config, state, false);
}

/**
 * @brief Read current level on the OneWire line.
 *
 * @param[out] high True if line is high
 */
RX_STATIC_TESTABLE rx_err_t internal_read_line(const rx_bus_config_t* bus_config, bool* high)
{
  return gpio_read(bus_config->proto.onewire.pin, high);
}

/**
 * @brief Reset runtime search tracking.
 */
static void internal_reset_search_state(onewire_runtime_state_t* state)
{
  memset(state->last_rom, 0, sizeof(state->last_rom));
  state->last_discrepancy = 0;
  state->last_device_flag = false;
}

