Locked-Inc/STAR/star-rx72n-firmware/libs/rx_bus/src/rx_bus_onewire.c
/* =============================================================================
 * Protocol Primitive Helpers
 * =============================================================================
 */

/**
 * @brief Issue 1-Wire reset pulse and detect device presence
 *
 * @details
 * Executes the 1-Wire reset/presence detect sequence. Controller drives line
 * low for 480us (reset pulse), then releases and samples during presence
 * window. Devices respond by pulling line low within 60us of release.
 *
 * @par Timing Diagram:
 * @code
 *          |<-- 480us -->|<-70us->|<-- 410us -->|
 *     _____|             |________|_____________|_____
 *          |_____________|        |             |
 *          ^             ^        ^             ^
 *          |             |        |             |
 *        Drive         Release  Sample       Complete
 *         Low                   Presence
 * @endcode
 *
 * @par Algorithm:
 * 1. Drive line low via internal_drive_low()
 * 2. Delay 480us (reset pulse duration)
 * 3. Release line via internal_release_line()
 * 4. Delay 70us (presence wait)
 * 5. Sample line level
 * 6. presence = !line_high (low = device present)
 * 7. Delay 410us (complete reset slot)
 *
 * @param[in] bus_config Bus configuration with GPIO pin
 * @param[in,out] state Runtime state for GPIO mode tracking
 * @param[out] presence Set to true if device responded (line went low)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success, presence result valid
 * @retval k_rx_err_* GPIO operation failed
 *
 * @pre bus_config != nullptr
 * @pre state != nullptr
 * @pre presence != nullptr
 * @post *presence indicates device response
 * @post Line released (high via pullup)
 *
 * @note Total reset slot: ~960us
 * @note Multiple devices can respond simultaneously
 *
 * @see k_onewire_reset_pulse_us Reset pulse duration (480us)
 * @see k_onewire_presence_wait_us Presence sample delay (70us)
 * @see k_onewire_presence_tail_us Remaining window after sample (410us)
 */
RX_STATIC_TESTABLE rx_err_t internal_reset_pulse(rx_bus_config_t*         bus_config,
                                                 onewire_runtime_state_t* state,
                                                 bool*                    presence)
{
  rx_err_t err = internal_drive_low(bus_config, state);
  if (err != k_rx_ok) {
    return err;
  }

  internal_delay_us(k_onewire_reset_pulse_us);

  err = internal_release_line(bus_config, state);
  if (err != k_rx_ok) {
    return err;
  }

  internal_delay_us(k_onewire_presence_wait_us);
  bool line_high = true;
  err            = internal_read_line(bus_config, &line_high);
  if (err != k_rx_ok) {
    return err;
  }

  *presence = !line_high;
  internal_delay_us(k_onewire_presence_tail_us);

  return k_rx_ok;
}

/**
 * @brief Write a single bit on the 1-Wire bus
 *
 * @details
 * Writes one bit using the 1-Wire write time slot protocol. Write-1 and
 * Write-0 differ in how long the line is held low.
 *
 * @par Write-1 Timing:
 * @code
 *     |<-6us->|<------ 64us ------>|
 *     |______|                     |
 *            |_____________________|
 * @endcode
 *
 * @par Write-0 Timing:
 * @code
 *     |<-------- 60us -------->|<10us>|
 *     |________________________|      |
 *                              |______|
 * @endcode
 *
 * @param[in] bus_config Bus configuration with GPIO pin
 * @param[in,out] state Runtime state for GPIO mode tracking
 * @param[in] bit Value to write (true=1, false=0)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success, bit written
 * @retval k_rx_err_* GPIO operation failed
 *
 * @pre bus_config != nullptr
 * @pre state != nullptr
 * @post Bit transmitted, line released high
 *
 * @note Total write slot: ~70us
 *
 * @see internal_write_byte() Writes 8 bits LSB-first
 */
RX_STATIC_TESTABLE rx_err_t internal_write_bit(rx_bus_config_t*         bus_config,
                                               onewire_runtime_state_t* state,
                                               const bool               bit)
{
  rx_err_t err = internal_drive_low(bus_config, state);
  if (err != k_rx_ok) {
    return err;
  }

  if (bit) {
    internal_delay_us(k_onewire_write_1_low_us);
    err = internal_release_line(bus_config, state);
    if (err != k_rx_ok) {
      return err;
    }
    internal_delay_us(k_onewire_write_1_high_us);
  } else {
    internal_delay_us(k_onewire_write_0_low_us);
    err = internal_release_line(bus_config, state);
    if (err != k_rx_ok) {
      return err;
    }
    internal_delay_us(k_onewire_write_0_high_us);
  }
  return k_rx_ok;
}

/**
 * @brief Read a single bit from the 1-Wire bus
 *
 * @details
 * Reads one bit using the 1-Wire read time slot protocol. Controller initiates
 * by driving low briefly, then releases and samples the line. Device drives
 * low for 0, leaves high for 1.
 *
 * @par Read Timing:
 * @code
 *     |<6us>|<-9us->|<---- 55us ---->|
 *     |_____|       |                |
 *           |_______|________________| (reading 0)
 *           |_______________________| (reading 1)
 *           ^       ^
 *           |       |
 *        Release  Sample
 * @endcode
 *
 * @param[in] bus_config Bus configuration with GPIO pin
 * @param[in,out] state Runtime state for GPIO mode tracking
 * @param[out] bit Read value (true=1/high, false=0/low)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success, bit read into output
 * @retval k_rx_err_* GPIO operation failed
 *
 * @pre bus_config != nullptr
 * @pre state != nullptr
 * @pre bit != nullptr
 * @post *bit contains read value
 * @post Line released high
 *
 * @note Total read slot: ~70us
 * @note Sample point: ~15us after slot start
 *
 * @see internal_read_byte() Reads 8 bits LSB-first
 */
RX_STATIC_TESTABLE rx_err_t internal_read_bit(rx_bus_config_t*         bus_config,
                                              onewire_runtime_state_t* state,
                                              bool*                    bit)
{
  rx_err_t err = internal_drive_low(bus_config, state);
  if (err != k_rx_ok) {
    return err;
  }

  internal_delay_us(k_onewire_read_init_us);

  err = internal_release_line(bus_config, state);
  if (err != k_rx_ok) {
    return err;
  }

  const uint32_t sample_delay_us = (k_onewire_read_sample_us > k_onewire_read_init_us)
                                     ? (k_onewire_read_sample_us - k_onewire_read_init_us)
                                     : k_onewire_read_sample_us;
  internal_delay_us(sample_delay_us);

  bool line_high = true;
  err            = internal_read_line(bus_config, &line_high);
  if (err != k_rx_ok) {
    return err;
  }

  *bit = line_high;
  internal_delay_us(k_onewire_read_recovery_us);

