Locked-Inc/STAR/star-rx72n-firmware/libs/rx_bus/src/rx_bus_onewire.c
  return k_rx_ok;
}

/**
 * @brief Write a byte (LSB first).
 */
RX_STATIC_TESTABLE rx_err_t internal_write_byte(rx_bus_config_t*         bus_config,
                                                onewire_runtime_state_t* state,
                                                const uint8_t            byte)
{
  for (uint8_t i = 0; i < k_bits_per_byte; ++i) {
    const bool     bit = ((byte >> i) & k_onewire_single_bit_mask) != 0U;
    const rx_err_t err = internal_write_bit(bus_config, state, bit);
    if (err != k_rx_ok) {
      return err;
    }
  }
  return k_rx_ok;
}

/**
 * @brief Read a byte (LSB first).
 */
RX_STATIC_TESTABLE rx_err_t internal_read_byte(rx_bus_config_t*         bus_config,
                                               onewire_runtime_state_t* state,
                                               uint8_t*                 byte)
{
  uint8_t value = 0;
  for (uint8_t i = 0; i < k_bits_per_byte; ++i) {
    bool           bit = false;
    const rx_err_t err = internal_read_bit(bus_config, state, &bit);
    if (err != k_rx_ok) {
      return err;
    }
    if (bit) {
      value |= (uint8_t)(k_onewire_bit_mask_lsb << i);
    }
  }

  *byte = value;
  return k_rx_ok;
}

/**
 * @brief Process one ROM search bit position.
 *
 * @param[in] bus_config Bus configuration node
 * @param[in] state Runtime OneWire state
 * @param[in,out] rom ROM buffer under construction
 * @param[in] bit_number Current bit index (1..64)
 * @param[in,out] rom_byte_index Current ROM byte index
 * @param[in,out] rom_bit_mask Current ROM bit mask
 * @param[in,out] last_zero Last discrepancy bit index
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_search_step(rx_bus_config_t*         bus_config,
                                                 onewire_runtime_state_t* state,
                                                 uint8_t                  rom[k_onewire_rom_bytes],
                                                 const uint8_t            bit_number,
                                                 uint8_t*                 rom_byte_index,
                                                 uint8_t*                 rom_bit_mask,
                                                 uint8_t*                 last_zero)
{
  RX_CHECK_NULL_PTR(bus_config, s_tag, "bus_config pointer is nullptr");
  RX_CHECK_NULL_PTR(state, s_tag, "state pointer is nullptr");

  bool     bit = false;
  rx_err_t err = internal_read_bit(bus_config, state, &bit);
  if (err != k_rx_ok) {
    return err;
  }
  bool comp_bit = false;
  err           = internal_read_bit(bus_config, state, &comp_bit);
  if (err != k_rx_ok) {
    return err;
  }
  if (bit && comp_bit) {
    return k_rx_err_hw_error;
  }
  bool search_direction = false;
  if (!bit && !comp_bit) {
    if (bit_number == state->last_discrepancy) {
      search_direction = true;
    } else if (bit_number > state->last_discrepancy) {
      search_direction = false;
    } else {
      search_direction = ((state->last_rom[*rom_byte_index] & *rom_bit_mask) != 0U);
    }
    if (!search_direction) {
      *last_zero = bit_number;
    }
  } else {
    search_direction = bit;
  }

  if (search_direction) {
    rom[*rom_byte_index] |= *rom_bit_mask;
  } else {
    rom[*rom_byte_index] &= (uint8_t) ~(*rom_bit_mask);
  }

  err = internal_write_bit(bus_config, state, search_direction);
  if (err != k_rx_ok) {
    return err;
  }

  *rom_bit_mask <<= k_onewire_bit_mask_lsb;
  if (*rom_bit_mask == k_onewire_no_discrepancy) {
    (*rom_byte_index)++;
    *rom_bit_mask = k_onewire_rom_bit_mask_reset;
  }
  return k_rx_ok;
}

/**
 * @brief Execute the ROM search bit loop.
 *
 * @param[in] bus_config Bus configuration node
 * @param[in] state Runtime OneWire state
 * @param[out] rom ROM buffer under construction
 * @param[out] last_zero Last discrepancy bit index
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_search_bits(rx_bus_config_t*         bus_config,
                                                 onewire_runtime_state_t* state,
                                                 uint8_t                  rom[k_onewire_rom_bytes],
                                                 uint8_t*                 last_zero)
{
  RX_CHECK_NULL_PTR(bus_config, s_tag, "bus_config pointer is nullptr");
  RX_CHECK_NULL_PTR(state, s_tag, "state pointer is nullptr");
  RX_CHECK_NULL_PTR(rom, s_tag, "rom pointer is nullptr");
  RX_CHECK_NULL_PTR(last_zero, s_tag, "last_zero pointer is nullptr");
  const uint8_t total_bits     = k_onewire_rom_bytes * k_bits_per_byte;
  uint8_t       rom_byte_index = 0;
  uint8_t       rom_bit_mask   = k_onewire_bit_mask_lsb;
  for (uint8_t bit_number = k_onewire_first_bit_number; bit_number <= total_bits; ++bit_number) {
    const rx_err_t err = internal_search_step(bus_config,
                                              state,
                                              rom,
                                              bit_number,
                                              &rom_byte_index,
                                              &rom_bit_mask,
                                              last_zero);
    if (err != k_rx_ok) {
      return err;
    }
  }
  return k_rx_ok;
}

/**
 * @brief Execute one iteration of the 1-Wire ROM search algorithm
 *
 * @details
 * Performs a single pass of the binary tree ROM search algorithm. Each call
 * discovers one device ROM by traversing the binary tree of device addresses.
 * Tracks search state (discrepancy points) to enumerate all devices.
 *
 * @par Search Algorithm:
 * The 64-bit ROM forms a binary tree. At each bit position:
 * 1. Read bit and complement from all devices
 * 2. If discrepancy (0,0): choose direction based on last_discrepancy
 * 3. If no discrepancy: follow the bit value
 * 4. Write chosen direction to select devices
 * 5. Track discrepancy points for subsequent iterations
 *
 * @par Algorithm Steps:
 * 1. Check last_device_flag (return if all found)
 * 2. Issue reset, check presence
 * 3. Send SEARCH_ROM command (0xF0)
 * 4. For each of 64 bits: internal_search_step()
 * 5. Update last_discrepancy for next iteration
 * 6. Verify ROM CRC-8
 * 7. Copy ROM to last_rom for next iteration
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] state Runtime state with search tracking
 * @param[out] rom 8-byte buffer for discovered ROM
 * @param[out] device_found Set to true if valid ROM discovered
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success (check device_found for result)
 * @retval k_rx_err_crc_mismatch ROM CRC validation failed
 * @retval k_rx_err_hw_error Bus collision detected
 * @retval k_rx_err_* Other bus/GPIO errors
 *
 * @pre bus_config != nullptr
 * @pre state != nullptr
 * @pre rom != nullptr
 * @pre device_found != nullptr
 * @post On success with device_found: rom contains valid 64-bit address
 * @post state->last_rom updated for next iteration
 * @post state->last_device_flag set when no more devices
 *
 * @note Call repeatedly until device_found == false
 * @note Uses CRC-8 (Maxim/Dallas polynomial) for ROM validation
 *
 * @see rx_bus_onewire_search() Public API using this
 */
RX_STATIC_TESTABLE rx_err_t internal_search_iteration(rx_bus_config_t*         bus_config,
                                                      onewire_runtime_state_t* state,
                                                      uint8_t rom[k_onewire_rom_bytes],
                                                      bool*   device_found)
{
  RX_CHECK_NULL_PTR(bus_config, s_tag, "bus_config pointer is nullptr");
  RX_CHECK_NULL_PTR(state, s_tag, "state pointer is nullptr");
  RX_CHECK_NULL_PTR(rom, s_tag, "rom pointer is nullptr");
  RX_CHECK_NULL_PTR(device_found, s_tag, "device_found pointer is nullptr");
  uint8_t last_zero = k_onewire_search_last_zero_init;
  *device_found     = false;

  if (state->last_device_flag) {
    return k_rx_ok;
  }
  bool     presence = false;
  rx_err_t err      = internal_reset_pulse(bus_config, state, &presence);
  if (err != k_rx_ok) {
    return err;
  }

  if (!presence) {
    state->last_discrepancy = k_onewire_no_discrepancy;
    state->last_device_flag = true;
    return k_rx_ok;
  }

