Locked-Inc/STAR/star-rx72n-firmware/libs/rx_bus/src/rx_bus_onewire.c
  err = internal_write_byte(bus_config, state, k_onewire_cmd_search_rom);
  if (err != k_rx_ok) {
    return err;
  }

  memset(rom, 0, k_onewire_rom_bytes);

  err = internal_search_bits(bus_config, state, rom, &last_zero);
  if (err != k_rx_ok) {
    return err;
  }
  state->last_discrepancy = last_zero;
  if (state->last_discrepancy == k_onewire_no_discrepancy) {
    state->last_device_flag = true;
  }

  memcpy(state->last_rom, rom, k_onewire_rom_bytes);
  uint32_t crc_out = 0U;
  (void)rx_crc8_maxim(rom, k_onewire_rom_crc_idx, &crc_out);
  if ((uint8_t)crc_out != rom[k_onewire_rom_crc_idx]) {
    return k_rx_err_crc_mismatch;
  }

  *device_found = true;
  return k_rx_ok;
}
/* =============================================================================
 * Callback Context Structures
 * =============================================================================
 */

#ifndef UNIT_TEST
typedef struct {
  rx_err_t result;
} onewire_simple_ctx_t;

typedef struct {
  bool*    presence;
  rx_err_t result;
} onewire_reset_ctx_t;

typedef struct {
  bool     bit;
  rx_err_t result;
} onewire_write_bit_ctx_t;

typedef struct {
  bool*    bit;
  rx_err_t result;
} onewire_read_bit_ctx_t;

typedef struct {
  uint8_t  byte;
  rx_err_t result;
} onewire_write_byte_ctx_t;

typedef struct {
  uint8_t* byte;
  rx_err_t result;
} onewire_read_byte_ctx_t;

typedef struct {
  const uint8_t* data;
  uint32_t       length;
  rx_err_t       result;
} onewire_write_buf_ctx_t;

typedef struct {
  uint8_t* data;
  uint32_t length;
  rx_err_t result;
} onewire_read_buf_ctx_t;

typedef struct {
  const uint8_t* rom;
  rx_err_t       result;
} onewire_match_rom_ctx_t;

typedef struct {
  uint8_t* rom;
  rx_err_t result;
} onewire_read_rom_ctx_t;

typedef struct {
  uint8_t*  roms;
  uint32_t  max_devices;
  uint32_t* num_devices;
  rx_err_t  result;
} onewire_search_ctx_t;
#endif /* UNIT_TEST */

/* =============================================================================
 * Callback Implementations
 * =============================================================================
 */

/**
 * @brief Helper macro to validate OneWire bus type and initialization state.
 *
 * Reduces repetitive validation code across callback functions.
 *
 * @param[in] bus_config Bus configuration to validate
 * @param[in,out] ctx Context structure with result field
 * @param[in] check_initialized True to also check initialization status
 */
#define CHECK_ONEWIRE_BUS(bus_config, ctx, check_initialized)                                      \
  do {                                                                                             \
    if ((bus_config)->type != k_bus_type_onewire) {                                                \
      rx_log_error(s_tag, "Bus is not OneWire type");                                              \
      (ctx)->result = k_rx_err_invalid_arg;                                                        \
      return (ctx)->result;                                                                        \
    }                                                                                              \
    if ((check_initialized) && !(bus_config)->initialized) {                                       \
      rx_log_error(s_tag, "Bus not initialized");                                                  \
      (ctx)->result = k_rx_err_invalid_state;                                                      \
      return (ctx)->result;                                                                        \
    }                                                                                              \
  } while (0)

RX_STATIC_TESTABLE rx_err_t internal_onewire_init_callback(rx_bus_config_t* bus_config,
                                                           void*            user_ctx)
{
  onewire_simple_ctx_t* ctx = (onewire_simple_ctx_t*)user_ctx;

  CHECK_ONEWIRE_BUS(bus_config, ctx, false);

  onewire_runtime_state_t* state = nullptr;
  rx_err_t                 err   = internal_acquire_state(bus_config, &state);
  if (err != k_rx_ok) {
    ctx->result = err;
    return err;
  }
  err = gpio_set_input(bus_config->proto.onewire.pin);
  if (err != k_rx_ok) {
    ctx->result = err;
    return err;
  }

  /* Post-condition: Verify pin reads as input with pullup */
  bool pin_state = false;
  err            = gpio_read(bus_config->proto.onewire.pin, &pin_state);
  if (err != k_rx_ok) {
    rx_log_error(s_tag, "Post-init pin read failed");
    ctx->result = k_rx_err_hw_error;
    return k_rx_err_hw_error;
  }

  if (!pin_state) {
    rx_log_warn(s_tag, "OneWire pin not pulled high - check 4.7k pullup resistor");
    /* Continue anyway - may work if device pulls line */
  }
  state->line_is_output = false;
  internal_reset_search_state(state);

  bus_config->initialized = true;
  ctx->result             = k_rx_ok;
  return k_rx_ok;
}
/**
 * @brief Release a state pool entry for a given bus config handle.
 *
 * @details
 * Scans the static state pool for the entry matching the bus config's handle
 * pointer. Clears the in_use flag and nulls the handle so the slot can be
 * reused by a future rx_bus_onewire_init() call.
 *
 * @param[in,out] bus_config Bus configuration whose state to release
 *
 * @pre bus_config != nullptr
 * @post Matching pool entry marked !in_use
 * @post bus_config->handle == nullptr
 */
static void internal_release_state(rx_bus_config_t* bus_config)
{
  if (bus_config->handle == nullptr) {
    return;
  }

  for (uint32_t i = k_onewire_instance_idx_start; i < k_onewire_max_instances; ++i) {
    const bool slot_in_use = s_state_pool[i].in_use;
    const bool handle_matches =
      (&s_state_pool[i].state == (onewire_runtime_state_t*)bus_config->handle);
    if (slot_in_use & handle_matches) {
      s_state_pool[i].in_use = false;
      s_state_pool[i].state  = (onewire_runtime_state_t){0};
      break;
    }
  }

  bus_config->handle = nullptr;
}

/**
 * @brief Callback for OneWire bus deinitialization.
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Simple context with result field
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_deinit_callback(rx_bus_config_t* bus_config,
                                                             void*            user_ctx)
{
  onewire_simple_ctx_t* ctx = (onewire_simple_ctx_t*)user_ctx;

  CHECK_ONEWIRE_BUS(bus_config, ctx, false);

  internal_release_state(bus_config);
  bus_config->initialized = false;
  ctx->result             = k_rx_ok;
  return k_rx_ok;
}

/**
 * @brief Callback to perform OneWire reset pulse and detect presence
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing presence output pointer
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_reset_callback(rx_bus_config_t* bus_config,
                                                            void*            user_ctx)
{
  onewire_reset_ctx_t*     ctx      = (onewire_reset_ctx_t*)user_ctx;
  onewire_runtime_state_t* state    = nullptr;
  bool                     presence = false;
  rx_err_t                 err      = k_rx_ok;

  CHECK_ONEWIRE_BUS(bus_config, ctx, true);

  if (ctx->presence == nullptr) {
    rx_log_error(s_tag, "OneWire reset nullptr presence pointer");
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }

  state = internal_get_state(bus_config);
  err   = internal_reset_pulse(bus_config, state, &presence);
  if (err != k_rx_ok) {
    ctx->result = err;
    return err;
  }

  *ctx->presence = presence;

  ctx->result = k_rx_ok;
  return k_rx_ok;
}

/**
 * @brief Callback to write a single bit on the OneWire bus
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing bit value to write
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_write_bit_callback(rx_bus_config_t* bus_config,
                                                                void*            user_ctx)
{
  onewire_write_bit_ctx_t* ctx   = (onewire_write_bit_ctx_t*)user_ctx;
  onewire_runtime_state_t* state = nullptr;
  rx_err_t                 err   = k_rx_ok;

  if (bus_config->type != k_bus_type_onewire) {
    rx_log_error(s_tag, "Bus is not OneWire type");
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }
  if (!bus_config->initialized) {
    rx_log_error(s_tag, "Bus not initialized");
    ctx->result = k_rx_err_invalid_state;
    return ctx->result;
  }

  state = internal_get_state(bus_config);
  err   = internal_write_bit(bus_config, state, ctx->bit);
  if (err != k_rx_ok) {
    ctx->result = err;
    return err;
  }
  ctx->result = err;
  return err;
}

/**
 * @brief Callback to read a single bit from the OneWire bus
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing bit output pointer
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_read_bit_callback(rx_bus_config_t* bus_config,
                                                               void*            user_ctx)
{
  onewire_read_bit_ctx_t*  ctx   = (onewire_read_bit_ctx_t*)user_ctx;
  onewire_runtime_state_t* state = nullptr;
  bool                     bit   = false;
  rx_err_t                 err   = k_rx_ok;

  if (bus_config->type != k_bus_type_onewire) {
    rx_log_error(s_tag, "Bus is not OneWire type");
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }
  if (!bus_config->initialized) {
    rx_log_error(s_tag, "Bus not initialized");
    ctx->result = k_rx_err_invalid_state;
    return ctx->result;
  }

  if (ctx->bit == nullptr) {
    rx_log_error(s_tag, "OneWire read_bit nullptr bit pointer");
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }
  state = internal_get_state(bus_config);
  err   = internal_read_bit(bus_config, state, &bit);
  if (err == k_rx_ok) {
    *ctx->bit = bit;
  }

