Locked-Inc/STAR/star-rx72n-firmware/libs/rx_bus/src/rx_bus_onewire.c
  ctx->result = err;
  return err;
}

/**
 * @brief Callback to write a single byte on the OneWire bus
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing byte value to write
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_write_byte_callback(rx_bus_config_t* bus_config,
                                                                 void*            user_ctx)
{
  onewire_write_byte_ctx_t* ctx = (onewire_write_byte_ctx_t*)user_ctx;

  if (bus_config->type != k_bus_type_onewire || !bus_config->initialized) {
    rx_log_error(s_tag, "Bus invalid or not initialized");
    ctx->result = k_rx_err_invalid_state;
    return ctx->result;
  }

  onewire_runtime_state_t* state = internal_get_state(bus_config);
  const rx_err_t           err   = internal_write_byte(bus_config, state, ctx->byte);
  if (err != k_rx_ok) {
    ctx->result = err;
    return err;
  }
  ctx->result = err;
  return err;
}

/**
 * @brief Callback to read a single byte from the OneWire bus
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing byte output pointer
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_read_byte_callback(rx_bus_config_t* bus_config,
                                                                void*            user_ctx)
{
  onewire_read_byte_ctx_t* ctx   = (onewire_read_byte_ctx_t*)user_ctx;
  onewire_runtime_state_t* state = nullptr;
  uint8_t                  byte  = 0;
  rx_err_t                 err   = k_rx_ok;

  if (bus_config->type != k_bus_type_onewire || !bus_config->initialized) {
    rx_log_error(s_tag, "Bus invalid or not initialized");
    ctx->result = k_rx_err_invalid_state;
    return ctx->result;
  }

  if (ctx->byte == nullptr) {
    rx_log_error(s_tag, "OneWire read_byte nullptr byte pointer");
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }

  state = internal_get_state(bus_config);
  err   = internal_read_byte(bus_config, state, &byte);
  if (err == k_rx_ok) {
    *ctx->byte = byte;
  }

  ctx->result = err;
  return err;
}

/**
 * @brief Callback to write a buffer of bytes on the OneWire bus
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing data pointer and length
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_write_buffer_callback(rx_bus_config_t* bus_config,
                                                                   void*            user_ctx)
{
  onewire_write_buf_ctx_t* ctx   = (onewire_write_buf_ctx_t*)user_ctx;
  onewire_runtime_state_t* state = nullptr;
  rx_err_t                 err   = k_rx_ok;

  if (ctx->length == 0U) {
    ctx->result = k_rx_ok;
    return k_rx_ok;
  }
  if (ctx->length > k_onewire_max_buf_bytes) {
    ctx->result = k_rx_err_invalid_size;
    return ctx->result;
  }
  if (bus_config->type != k_bus_type_onewire || !bus_config->initialized) {
    rx_log_error(s_tag, "Bus invalid or not initialized");
    ctx->result = k_rx_err_invalid_state;
    return ctx->result;
  }

  if (ctx->data == nullptr) {
    rx_log_error(s_tag, "OneWire write_buffer nullptr data pointer");
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }

  state = internal_get_state(bus_config);
  for (uint32_t i = 0; (i < k_onewire_max_buf_bytes) && (i < ctx->length); ++i) {
    err = internal_write_byte(bus_config, state, ctx->data[i]);
    if (err != k_rx_ok) {
      ctx->result = err;
      return err;
    }
  }

  ctx->result = k_rx_ok;
  return k_rx_ok;
}
/**
 * @brief Callback to read a buffer of bytes from the OneWire bus
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing data pointer and length
 *
 * @return k_rx_ok on success, error code on failure
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_read_buffer_callback(rx_bus_config_t* bus_config,
                                                                  void*            user_ctx)
{
  onewire_read_buf_ctx_t*  ctx   = (onewire_read_buf_ctx_t*)user_ctx;
  onewire_runtime_state_t* state = nullptr;
  uint8_t                  byte  = 0;
  rx_err_t                 err   = k_rx_ok;

  if (ctx->length == 0U) {
    ctx->result = k_rx_ok;
    return k_rx_ok;
  }
  if (ctx->length > k_onewire_max_buf_bytes) {
    ctx->result = k_rx_err_invalid_size;
    return ctx->result;
  }
  if (bus_config->type != k_bus_type_onewire || !bus_config->initialized) {
    rx_log_error(s_tag, "Bus invalid or not initialized");
    ctx->result = k_rx_err_invalid_state;
    return ctx->result;
  }

  if (ctx->data == nullptr) {
    rx_log_error(s_tag, "OneWire read_buffer nullptr data pointer");
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }

  state = internal_get_state(bus_config);
  for (uint32_t i = 0; (i < k_onewire_max_buf_bytes) && (i < ctx->length); ++i) {
    byte = 0;
    err  = internal_read_byte(bus_config, state, &byte);
    if (err != k_rx_ok) {
      ctx->result = err;
      return err;
    }
    ctx->data[i] = byte;
  }

  ctx->result = k_rx_ok;
  return k_rx_ok;
}

/**
 * @brief Callback to issue OneWire Skip ROM command
 *
 * Sends the Skip ROM command (0xCC) to address all devices on the bus.
 *
 * @param[in] bus_config Bus configuration node
 * @param[in] user_ctx User context (unused)
 *
 * @return k_rx_ok on success
 * @return k_rx_err_invalid_state if bus not initialized
 * @return k_rx_err_not_found if no device presence detected
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_skip_rom_callback(rx_bus_config_t* bus_config,
                                                               void*            user_ctx)
{
  (void)user_ctx;

  if (bus_config->type != k_bus_type_onewire || !bus_config->initialized) {
    return k_rx_err_invalid_state;
  }

  onewire_runtime_state_t* state = internal_get_state(bus_config);

  bool     presence = false;
  rx_err_t err      = internal_reset_pulse(bus_config, state, &presence);
  if (err != k_rx_ok) {
    return err;
  }

  if (!presence) {
    return k_rx_err_not_found;
  }

  err = internal_write_byte(bus_config, state, k_onewire_cmd_skip_rom);
  if (err != k_rx_ok) {
    return err;
  }
  return k_rx_ok;
}

/**
 * @brief Callback to issue OneWire Match ROM command
 *
 * Sends the Match ROM command (0x55) followed by 64-bit ROM address to
 * select a specific device on a multi-device bus.
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing ROM address
 *
 * @return k_rx_ok on success
 * @return k_rx_err_invalid_state if bus not initialized
 * @return k_rx_err_not_found if no device presence detected
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_match_rom_callback(rx_bus_config_t* bus_config,
                                                                void*            user_ctx)
{
  onewire_match_rom_ctx_t* ctx = (onewire_match_rom_ctx_t*)user_ctx;

  if (bus_config->type != k_bus_type_onewire || !bus_config->initialized) {
    ctx->result = k_rx_err_invalid_state;
    return ctx->result;
  }
  if (ctx->rom == nullptr) {
    rx_log_error(s_tag, "OneWire match_rom nullptr ROM pointer");
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }

  onewire_runtime_state_t* state    = internal_get_state(bus_config);
  bool                     presence = false;
  rx_err_t                 err      = internal_reset_pulse(bus_config, state, &presence);
  if (err != k_rx_ok) {
    ctx->result = err;
    return err;
  }
  if (!presence) {
    ctx->result = k_rx_err_not_found;
    return ctx->result;
  }

