Locked-Inc/STAR/star-rx72n-firmware/libs/rx_bus/src/rx_bus_onewire.c
  err = internal_write_byte(bus_config, state, k_onewire_cmd_match_rom);
  if (err != k_rx_ok) {
    ctx->result = err;
    return err;
  }
  for (uint8_t i = 0; i < k_onewire_rom_bytes; ++i) {
    err = internal_write_byte(bus_config, state, ctx->rom[i]);
    if (err != k_rx_ok) {
      ctx->result = err;
      return err;
    }
  }
  ctx->result = k_rx_ok;
  return k_rx_ok;
}

/**
 * @brief Callback to read ROM address from a single OneWire device
 *
 * Sends the Read ROM command (0x33) and reads 64-bit ROM address with CRC.
 * Only works when exactly one device is on the bus.
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing ROM output buffer
 *
 * @return k_rx_ok on success
 * @return k_rx_err_invalid_state if bus not initialized
 * @return k_rx_err_not_found if no device presence detected
 * @return k_rx_err_crc_mismatch if ROM CRC validation fails
 * @return propagated error from rx_crc8_maxim() if CRC computation itself fails
 *         (ctx->result is also set to the propagated error in that case)
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_read_rom_callback(rx_bus_config_t* bus_config,
                                                               void*            user_ctx)
{
  onewire_read_rom_ctx_t* ctx     = (onewire_read_rom_ctx_t*)user_ctx;
  uint8_t                 byte    = 0;
  uint32_t                crc_out = 0U;

  if (bus_config->type != k_bus_type_onewire || !bus_config->initialized) {
    ctx->result = k_rx_err_invalid_state;
    return ctx->result;
  }
  if (ctx->rom == nullptr) {
    rx_log_error(s_tag, "OneWire read_rom nullptr ROM pointer");
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }

  onewire_runtime_state_t* state    = internal_get_state(bus_config);
  bool                     presence = false;
  rx_err_t                 err      = internal_reset_pulse(bus_config, state, &presence);
  if (err != k_rx_ok) {
    ctx->result = err;
    return err;
  }
  if (!presence) {
    ctx->result = k_rx_err_not_found;
    return ctx->result;
  }

  err = internal_write_byte(bus_config, state, k_onewire_cmd_read_rom);
  if (err != k_rx_ok) {
    ctx->result = err;
    return err;
  }
  for (uint8_t i = 0; i < k_onewire_rom_bytes; ++i) {
    err = internal_read_byte(bus_config, state, &byte);
    if (err != k_rx_ok) {
      ctx->result = err;
      return err;
    }
    ctx->rom[i] = byte;
  }

  (void)rx_crc8_maxim(ctx->rom, k_onewire_rom_crc_idx, &crc_out);
  if ((uint8_t)crc_out != ctx->rom[k_onewire_rom_crc_idx]) {
    ctx->result = k_rx_err_crc_mismatch;
    return ctx->result;
  }
  if (ctx->rom[k_onewire_rom_family_code_idx] == k_onewire_invalid_family_code) {
    rx_log_warn(s_tag, "OneWire ROM has invalid family code");
    /* Continue anyway - CRC passed, may be valid edge case */
  }
  ctx->result = k_rx_ok;
  return k_rx_ok;
}

/**
 * @brief Callback to search for all OneWire devices on the bus
 *
 * Implements the OneWire ROM search algorithm to discover all devices on
 * a multi-device bus. Returns array of 64-bit ROM addresses with CRC.
 *
 * @param[in] bus_config Bus configuration node
 * @param[in,out] user_ctx Context containing ROM buffer, max count, and output count
 *
 * @return k_rx_ok on success
 * @return k_rx_err_invalid_state if bus not initialized
 * @return k_rx_err_invalid_arg if parameters invalid or max_devices exceeded
 */
RX_STATIC_TESTABLE rx_err_t internal_onewire_search_callback(rx_bus_config_t* bus_config,
                                                             void*            user_ctx)
{
  onewire_search_ctx_t* ctx = (onewire_search_ctx_t*)user_ctx;
  uint8_t               rom[k_onewire_rom_bytes];
  bool                  device_found = false;
  rx_err_t              err          = k_rx_err_invalid_state;

  if (ctx->num_devices == nullptr) {
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }
  *ctx->num_devices = 0;

  if (ctx->max_devices == 0U) {
    ctx->result = k_rx_ok;
    return k_rx_ok;
  }

  if (ctx->max_devices > s_onewire_max_search_devices) {
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }
  if (ctx->roms == nullptr) {
    ctx->result = k_rx_err_invalid_arg;
    return ctx->result;
  }
  if (bus_config->type != k_bus_type_onewire || !bus_config->initialized) {
    ctx->result = k_rx_err_invalid_state;
    return ctx->result;
  }
  onewire_runtime_state_t* state = internal_get_state(bus_config);
  internal_reset_search_state(state);

  while (*ctx->num_devices < ctx->max_devices) {
    device_found = false;
    err          = internal_search_iteration(bus_config, state, rom, &device_found);
    if (err != k_rx_ok) {
      ctx->result = err;
      return err;
    }

    if (!device_found) {
      break;
    }

    memcpy(&ctx->roms[*ctx->num_devices * k_onewire_rom_bytes], rom, k_onewire_rom_bytes);
    (*ctx->num_devices)++;

    if (state->last_device_flag) {
      break;
    }
  }

  ctx->result = k_rx_ok;
  return k_rx_ok;
}

/* =============================================================================
 * Public API
 * =============================================================================
 */
/**
 * @brief Initialize a 1-Wire bus instance
 *
 * @details
 * Initializes a 1-Wire bus by configuring the GPIO pin as input (released)
 * and allocating runtime state from the static pool. Verifies pullup resistor
 * is present by checking line reads high after release.
 *
 * @par Algorithm:
 * 1. Validate manager and bus_name pointers
 * 2. Acquire runtime state from pool
 * 3. Configure GPIO as input (high-Z, pullup drives high)
 * 4. Verify line reads high (warn if not)
 * 5. Reset search state
 * 6. Mark bus as initialized
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name (must match registered bus)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success, bus ready for use
 * @retval k_rx_err_null_ptr nullptr manager or bus_name
 * @retval k_rx_err_not_found Bus name not registered
 * @retval k_rx_err_invalid_arg Bus is not 1-Wire type
 * @retval k_rx_err_no_mem Static state pool exhausted
 * @retval k_rx_err_hw_error GPIO configuration failed
 *
 * @pre manager != nullptr and initialized
 * @pre bus_name registered via rx_bus_manager_register()
 * @pre 4.7kOhm pullup resistor connected to data line
 * @post Bus ready for reset, read, write operations
 *
 * @note Logs warning if pullup not detected (may still work)
 *
 * @par Example:
 * @code
 * rx_err_t err = rx_bus_onewire_init(&bus_manager, "temp_sensor");
 * if (err != k_rx_ok) {
 *     rx_log_error("1W", "Init failed");
 * }
 * @endcode
 *
 * @see rx_bus_onewire_reset() First operation after init
 */
rx_err_t rx_bus_onewire_init(rx_bus_manager_t* manager, const char* bus_name)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");

  onewire_simple_ctx_t ctx = {.result = k_rx_err_hw_error};
  const rx_err_t       err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_init_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

/**
 * @brief Deinitialize OneWire bus and release state pool entry
 *
 * @details
 * Releases the runtime state allocated by rx_bus_onewire_init() back to the
 * static pool. Prevents state pool exhaustion in long-running test suites.
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success
 * @retval k_rx_err_null_ptr manager or bus_name is nullptr
 * @retval k_rx_err_not_found Bus not registered
 * @retval k_rx_err_invalid_arg Bus is not OneWire type
 *
 * @pre Bus was initialized via rx_bus_onewire_init()
 * @post State pool entry released for reuse
 * @post bus_config->initialized == false
 *
 * @see rx_bus_onewire_init() Initialization counterpart
 */
rx_err_t rx_bus_onewire_deinit(rx_bus_manager_t* manager, const char* bus_name)
{
  if (manager == nullptr) {
    return k_rx_err_null_ptr;
  }
  if (bus_name == nullptr) {
    return k_rx_err_null_ptr;
  }

  onewire_simple_ctx_t ctx = {.result = k_rx_err_hw_error};
  const rx_err_t       err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_deinit_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

/**
 * @brief Perform OneWire reset pulse and detect device presence
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name
 * @param[out] presence True if device responded, false otherwise
 *
 * @return k_rx_ok on success, error code on failure
 */
rx_err_t rx_bus_onewire_reset(rx_bus_manager_t* manager, const char* bus_name, bool* presence)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");
  RX_CHECK_NULL_PTR(presence, s_tag, "presence pointer is nullptr");

  onewire_reset_ctx_t ctx = {.presence = presence, .result = k_rx_err_hw_error};
  const rx_err_t      err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_reset_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

/**
 * @brief Write a single bit on the OneWire bus
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name
 * @param[in] bit Bit value to write (true=1, false=0)
 *
 * @return k_rx_ok on success, error code on failure
 */
rx_err_t rx_bus_onewire_write_bit(rx_bus_manager_t* manager, const char* bus_name, bool bit)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");

  onewire_write_bit_ctx_t ctx = {.bit = bit, .result = k_rx_err_hw_error};
  const rx_err_t          err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_write_bit_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

/**
 * @brief Read a single bit from the OneWire bus
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name
 * @param[out] bit Bit value read (true=1, false=0)
 *
 * @return k_rx_ok on success, error code on failure
 */
rx_err_t rx_bus_onewire_read_bit(rx_bus_manager_t* manager, const char* bus_name, bool* bit)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");
  RX_CHECK_NULL_PTR(bit, s_tag, "bit pointer is nullptr");

  onewire_read_bit_ctx_t ctx = {.bit = bit, .result = k_rx_err_hw_error};
  const rx_err_t         err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_read_bit_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

/**
 * @brief Write a single byte on the OneWire bus (LSB first)
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name
 * @param[in] byte Byte value to write
 *
 * @return k_rx_ok on success, error code on failure
 */
rx_err_t rx_bus_onewire_write_byte(rx_bus_manager_t* manager, const char* bus_name, uint8_t byte)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");

  onewire_write_byte_ctx_t ctx = {.byte = byte, .result = k_rx_err_hw_error};
  const rx_err_t           err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_write_byte_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

/**
 * @brief Read a single byte from the OneWire bus (LSB first)
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name
 * @param[out] byte Byte value read
 *
 * @return k_rx_ok on success, error code on failure
 */
rx_err_t rx_bus_onewire_read_byte(rx_bus_manager_t* manager, const char* bus_name, uint8_t* byte)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");
  RX_CHECK_NULL_PTR(byte, s_tag, "byte pointer is nullptr");

