Locked-Inc/STAR/star-rx72n-firmware/libs/rx_bus/src/rx_bus_onewire.c
  onewire_read_byte_ctx_t ctx = {.byte = byte, .result = k_rx_err_hw_error};
  const rx_err_t          err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_read_byte_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

rx_err_t rx_bus_onewire_write(rx_bus_manager_t* manager,
                              const char*       bus_name,
                              const uint8_t*    data,
                              const uint32_t    length)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");
  if (length > 0U) {
    RX_CHECK_NULL_PTR(data, s_tag, "data pointer is nullptr");
  }
  onewire_write_buf_ctx_t ctx = {.data = data, .length = length, .result = k_rx_err_hw_error};
  const rx_err_t          err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_write_buffer_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

rx_err_t
rx_bus_onewire_read(rx_bus_manager_t* manager, const char* bus_name, uint8_t* data, uint32_t length)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");
  if (length > 0U) {
    RX_CHECK_NULL_PTR(data, s_tag, "data pointer is nullptr");
  }
  onewire_read_buf_ctx_t ctx = {.data = data, .length = length, .result = k_rx_err_hw_error};
  const rx_err_t         err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_read_buffer_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

/**
 * @brief Issue OneWire Skip ROM command
 *
 * Sends Skip ROM command (0xCC) to address all devices on the bus.
 * Use when only one device is connected or when broadcasting to all devices.
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name
 *
 * @return k_rx_ok on success
 * @return k_rx_err_not_found if no device presence detected
 */
rx_err_t rx_bus_onewire_skip_rom(rx_bus_manager_t* manager, const char* bus_name)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");

  return rx_bus_manager_with_bus(manager, bus_name, internal_onewire_skip_rom_callback, nullptr);
}
/**
 * @brief Issue OneWire Match ROM command
 *
 * Sends Match ROM command (0x55) followed by 64-bit ROM address to select
 * a specific device on a multi-device bus.
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name
 * @param[in] rom 8-byte ROM address (family code + serial + CRC)
 *
 * @return k_rx_ok on success
 * @return k_rx_err_not_found if no device presence detected
 */
rx_err_t
rx_bus_onewire_match_rom(rx_bus_manager_t* manager, const char* bus_name, const uint8_t rom[8])
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");
  RX_CHECK_NULL_PTR(rom, s_tag, "rom pointer is nullptr");

  onewire_match_rom_ctx_t ctx = {.rom = rom, .result = k_rx_err_hw_error};
  const rx_err_t          err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_match_rom_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

/**
 * @brief Read ROM address from single OneWire device
 *
 * Sends Read ROM command (0x33) and reads 64-bit ROM address with CRC.
 * Only works when exactly one device is present on the bus.
 *
 * @param[in] manager Bus manager handle
 * @param[in] bus_name Bus configuration name
 * @param[out] rom 8-byte buffer for ROM address (family code + serial + CRC)
 *
 * @return k_rx_ok on success
 * @return k_rx_err_not_found if no device presence detected
 * @return k_rx_err_crc_mismatch if ROM CRC validation fails
 */
rx_err_t rx_bus_onewire_read_rom(rx_bus_manager_t* manager, const char* bus_name, uint8_t rom[8])
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");
  RX_CHECK_NULL_PTR(rom, s_tag, "rom pointer is nullptr");

  onewire_read_rom_ctx_t ctx = {.rom = rom, .result = k_rx_err_hw_error};
  const rx_err_t         err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_read_rom_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}

rx_err_t rx_bus_onewire_search(rx_bus_manager_t* manager,
                               const char*       bus_name,
                               uint8_t*          roms,
                               const uint32_t    max_devices,
                               uint32_t*         num_devices)
{
  RX_CHECK_NULL_PTR(manager, s_tag, "manager pointer is nullptr");
  RX_CHECK_NULL_PTR(bus_name, s_tag, "bus_name pointer is nullptr");
  RX_CHECK_NULL_PTR(roms, s_tag, "roms pointer is nullptr");
  RX_CHECK_NULL_PTR(num_devices, s_tag, "num_devices pointer is nullptr");

  onewire_search_ctx_t ctx = {
    .roms        = roms,
    .max_devices = max_devices,
    .num_devices = num_devices,
    .result      = k_rx_err_hw_error,
  };

  const rx_err_t err =
    rx_bus_manager_with_bus(manager, bus_name, internal_onewire_search_callback, &ctx);
  if (err != k_rx_ok) {
    return err;
  }
  return ctx.result;
}
